In [ ]:
import pandas as pd

data  = [1,2,3,4,5]
series = pd.Series(data) 
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
# Making series using dictionary
data= {"a":1,"b":2,"c":4}
print(data)
series = pd.Series(data)
print(series)

{'a': 1, 'b': 2, 'c': 4}
a    1
b    2
c    4
dtype: int64

In [8]:
data = [1,2,3,4]
index=["a","b","c","d"]
pd.Series(data,index=index)

a    1
b    2
c    3
d    4
dtype: int64

In [11]:
# Dataframe
# create a dataframe with dictonary
data = {
    "Name":['Avi',"john",'jack'],
    "Age":[22,33,44],
    "City":['Indore','New York','Dhar']
}
df = pd.DataFrame(data)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   Name  Age      City
0   Avi   22    Indore
1  john   33  New York
2  jack   44      Dhar

In [13]:
import numpy as np
# np.array(data)
np.array(df)

array([['Avi', 22, 'Indore'],
       ['john', 33, 'New York'],
       ['jack', 44, 'Dhar']], dtype=object)

In [14]:
# Create a data frame with list of dictonary
data = [
    {"Name":"Avi",	"Age":22,"City":"Indore"},
    {"Name":"john",	"Age":22,"City":"New York"},
    {"Name":"jack",	"Age":22,"City":"Dhar"},
]

pd.DataFrame(data)

   Name  Age      City
0   Avi   22    Indore
1  john   22  New York
2  jack   22      Dhar

In [4]:
# Pandas with CSV
df  = pd.read_csv("./sample_data/sales_records.csv")
# First five records
df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,5/2/2014,341417157,5/8/2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,7/5/2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2/1/2013,115456712,2/6/2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50

In [4]:
# Last five records
df.tail()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
95,Sub-Saharan Africa,Mali,Clothes,Online,M,7/26/2011,512878119,9/3/2011,888,109.28,35.84,97040.64,31825.92,65214.72
96,Asia,Malaysia,Fruits,Offline,L,11/11/2011,810711038,12/28/2011,6267,9.33,6.92,58471.11,43367.64,15103.47
97,Sub-Saharan Africa,Sierra Leone,Vegetables,Offline,C,6/1/2016,728815257,6/29/2016,1485,154.06,90.93,228779.10,135031.05,93748.05
98,North America,Mexico,Personal Care,Offline,M,7/30/2015,559427106,8/8/2015,5767,81.73,56.67,471336.91,326815.89,144521.02
99,Sub-Saharan Africa,Mozambique,Household,Offline,L,2/10/2012,665095412,2/15/2012,5367,668.27,502.54,3586605.09,2697132.18,889472.91

In [50]:
# Basic data frame operations (must)
# Display the data types of each column
print("data Types \n ",df.dtypes)

data Types
  Region             object
Country            object
Item Type          object
Sales Channel      object
Order Priority     object
Order Date         object
Order ID            int64
Ship Date          object
Units Sold          int64
Unit Price        float64
Unit Cost         float64
Total Revenue     float64
Total Cost        float64
Total Profit      float64
dtype: object

In [67]:
# Describe the data frame
print("\nStatistical Summary of data \n",)
df.describe()

Statistical Summary of data

,Order ID,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
count,1.000000e+02,100.000000,100.000000,100.000000,1.000000e+02,1.000000e+02,1.000000e+02
mean,5.550204e+08,5128.710000,276.761300,191.048000,1.373488e+06,9.318057e+05,4.416820e+05
std,2.606153e+08,2794.484562,235.592241,188.208181,1.460029e+06,1.083938e+06,4.385379e+05
min,1.146066e+08,124.000000,9.330000,6.920000,4.870260e+03,3.612240e+03,1.258020e+03
25%,3.389225e+08,2836.250000,81.730000,35.840000,2.687212e+05,1.688680e+05,1.214436e+05
50%,5.577086e+08,5382.500000,179.880000,107.275000,7.523144e+05,3.635664e+05,2.907680e+05
75%,7.907551e+08,7369.000000,437.200000,263.330000,2.212045e+06,1.613870e+06,6.358288e+05
max,9.940222e+08,9925.000000,668.270000,524.960000,5.997055e+06,4.509794e+06,1.719922e+06

In [57]:
# Group by a column and perform a aggregation
grouped = df.groupby('Country')['Total Profit'].mean()
print("Mean value by Country:\n",grouped)

Mean value by Country:
 Country
Albania           166635.360000
Angola            693911.510000
Australia         192201.706667
Austria           495007.890000
Azerbaijan        756463.415000
                      ...
The Gambia        346470.817500
Turkmenistan      633629.200000
Tuvalu            951410.500000
United Kingdom     46735.860000
Zambia            225246.900000
Name: Total Profit, Length: 76, dtype: float64

In [ ]:
# Find only unique value of a column [Important]
# Counts of each unique value:
df["Country"].value_counts() 

# returns a NumPy array of unique country values
# df['Country'].unique()

# returns an integer (set dropna=True to ignore NaN)
# df['Country'].nunique()

Country
The Gambia               4
Sao Tome and Principe    3
Australia                3
Djibouti                 3
Sierra Leone             3
                        ..
Slovenia                 1
Romania                  1
Nicaragua                1
Malaysia                 1
Mozambique               1
Name: count, Length: 76, dtype: int64

In [ ]:
print("type Series if select a single column",type(df['Item Type']))
df['Item Type']

type Series if select a single column <class 'pandas.core.series.Series'>

0           Baby Food
1              Cereal
2     Office Supplies
3              Fruits
4     Office Supplies
           ...
95            Clothes
96             Fruits
97         Vegetables
98      Personal Care
99          Household
Name: Item Type, Length: 100, dtype: object

In [ ]:
# Pick any row index
df.loc[0]

# Same as above
# df.iloc[0]

Region            Australia and Oceania
Country                          Tuvalu
Item Type                     Baby Food
Sales Channel                   Offline
Order Priority                        H
Order Date                    5/28/2010
Order ID                      669165933
Ship Date                     6/27/2010
Units Sold                         9925
Unit Price                       255.28
Unit Cost                        159.42
Total Revenue                 2533654.0
Total Cost                    1582243.5
Total Profit                   951410.5
Name: 0, dtype: object

In [14]:
# pick
# df.loc[0][1]
# df.iloc[0][1]

In [ ]:
# Accessing specified element
# Row , column name
df.at[1,'Country']

'Grenada'

In [19]:
df.iat[1,1]

'Grenada'

In [22]:
# Data Manupulation with Data Frame , I am picking an easy data to manupulat instead of whole csv
data = [
    {"Name":"Avi",	"Age":22,"City":"Indore"},
    {"Name":"john",	"Age":22,"City":"New York"},
    {"Name":"jack",	"Age":22,"City":"Dhar"},
]
df2 = pd.DataFrame(data)
df2

   Name  Age      City
0   Avi   22    Indore
1  john   22  New York
2  jack   22      Dhar

In [ ]:
# Adding a column
df2['salary'] = [500000,80000,30000]
df2

   Name  Age      City  salary
0   Avi   22    Indore  500000
1  john   22  New York   80000
2  jack   22      Dhar   30000

In [ ]:
# Removing a column
# It wil give an error because by default drop will check row index because axis=0 is default 
# df2.drop('salary')

# axis = 1 means to check column instead of row
df2.drop('salary',axis=1)

   Name  Age      City
0   Avi   22    Indore
1  john   22  New York
2  jack   22      Dhar

In [29]:
df2
# Salary is still there even after using drop

   Name  Age      City  salary
0   Avi   22    Indore  500000
1  john   22  New York   80000
2  jack   22      Dhar   30000

In [30]:
# to permanently drop the data
df2.drop('salary',axis=1,inplace=True)

In [31]:
df2

   Name  Age      City
0   Avi   22    Indore
1  john   22  New York
2  jack   22      Dhar

In [38]:
# Add age to the column
df2['Age'] = df2['Age'] + 1
# df2['Age'] +=  1

In [39]:
df2

   Name  Age      City
0   Avi   24    Indore
1  john   24  New York
2  jack   24      Dhar

In [41]:
# Drop based on row
df2.drop(2)

   Name  Age      City
0   Avi   24    Indore
1  john   24  New York

In [43]:
df2.drop(2,inplace=True)

In [45]:
df2

   Name  Age      City
0   Avi   24    Indore
1  john   24  New York